# Regression Dataset loading and RegressionDataset initialization

In this notebook, we check that the loading of a multi-axis Regression Dataset works as expected. Also, we check that the
RegressionDataset (for Pipelines) object works as expected.

## Import libraries

In [1]:
import pandas as pd
import numpy as np
from caits.visualization import plot_signal
from caits.loading import csv_loader_regression
from caits.dataset import RegressionDataset

## Load Dataset

In [2]:
data = csv_loader_regression("../examples/data/AirQuality.csv", x_cols=["Date", "Time", "PT08.S4(NO2)"], y_cols=["C6H6(GT)", "PT08.S1(CO)"], sep=";")
# data = csv_loader_regression("../examples/data/AirQuality.csv", y_cols=["C6H6(GT)", "PT08.S1(CO)"], sep=";")
# data = csv_loader_regression("../examples/data/AirQuality.csv", sep=";")
data["X"], data["y"]

(            Date      Time  PT08.S4(NO2)
 0     10/03/2004  18.00.00        1692.0
 1     10/03/2004  19.00.00        1559.0
 2     10/03/2004  20.00.00        1555.0
 3     10/03/2004  21.00.00        1584.0
 4     10/03/2004  22.00.00        1490.0
 ...          ...       ...           ...
 9466         NaN       NaN           NaN
 9467         NaN       NaN           NaN
 9468         NaN       NaN           NaN
 9469         NaN       NaN           NaN
 9470         NaN       NaN           NaN

 [9471 rows x 3 columns],
      C6H6(GT)  PT08.S1(CO)
 0        11,9       1360.0
 1         9,4       1292.0
 2         9,0       1402.0
 3         9,2       1376.0
 4         6,5       1272.0
 ...       ...          ...
 9466      NaN          NaN
 9467      NaN          NaN
 9468      NaN          NaN
 9469      NaN          NaN
 9470      NaN          NaN

 [9471 rows x 2 columns])

## Initialize Regression Dataset object

In [3]:
regression_data = RegressionDataset(**data)
regression_data

RegressionDataset with 9471 instances

In [4]:
regression_data.X

            Date      Time  PT08.S4(NO2)
0     10/03/2004  18.00.00        1692.0
1     10/03/2004  19.00.00        1559.0
2     10/03/2004  20.00.00        1555.0
3     10/03/2004  21.00.00        1584.0
4     10/03/2004  22.00.00        1490.0
...          ...       ...           ...
9466         NaN       NaN           NaN
9467         NaN       NaN           NaN
9468         NaN       NaN           NaN
9469         NaN       NaN           NaN
9470         NaN       NaN           NaN

[9471 rows x 3 columns]

In [5]:
regression_data.y

     C6H6(GT)  PT08.S1(CO)
0        11,9       1360.0
1         9,4       1292.0
2         9,0       1402.0
3         9,2       1376.0
4         6,5       1272.0
...       ...          ...
9466      NaN          NaN
9467      NaN          NaN
9468      NaN          NaN
9469      NaN          NaN
9470      NaN          NaN

[9471 rows x 2 columns]

## Loop over the Regression Dataset object

In [6]:
print("---------------------------------------------------")
for X_row, y_row in regression_data:
    # print(X_row, "\n\n", y_row)
    # print("---------------------------------------------------")
    pass

---------------------------------------------------

## Unify X and y in the same DataFrame

In [7]:
regression_data.unify()

            Date      Time  PT08.S4(NO2) C6H6(GT)  PT08.S1(CO)
0     10/03/2004  18.00.00        1692.0      NaN          NaN
1     10/03/2004  19.00.00        1559.0      NaN          NaN
2     10/03/2004  20.00.00        1555.0      NaN          NaN
3     10/03/2004  21.00.00        1584.0      NaN          NaN
4     10/03/2004  22.00.00        1490.0      NaN          NaN
...          ...       ...           ...      ...          ...
9466         NaN       NaN           NaN      NaN          NaN
9467         NaN       NaN           NaN      NaN          NaN
9468         NaN       NaN           NaN      NaN          NaN
9469         NaN       NaN           NaN      NaN          NaN
9470         NaN       NaN           NaN      NaN          NaN

[18942 rows x 5 columns]

## Make Regression Dataset to dictionary

In [8]:
regression_data.to_dict()

{'X':             Date      Time  PT08.S4(NO2)
 0     10/03/2004  18.00.00        1692.0
 1     10/03/2004  19.00.00        1559.0
 2     10/03/2004  20.00.00        1555.0
 3     10/03/2004  21.00.00        1584.0
 4     10/03/2004  22.00.00        1490.0
 ...          ...       ...           ...
 9466         NaN       NaN           NaN
 9467         NaN       NaN           NaN
 9468         NaN       NaN           NaN
 9469         NaN       NaN           NaN
 9470         NaN       NaN           NaN

 [9471 rows x 3 columns],
 'y':      C6H6(GT)  PT08.S1(CO)
 0        11,9       1360.0
 1         9,4       1292.0
 2         9,0       1402.0
 3         9,2       1376.0
 4         6,5       1272.0
 ...       ...          ...
 9466      NaN          NaN
 9467      NaN          NaN
 9468      NaN          NaN
 9469      NaN          NaN
 9470      NaN          NaN

 [9471 rows x 2 columns]}

## Index the Regression Dataset

In [15]:
print(*regression_data[100], sep="\n\n")

Date            14/03/2004
Time              22.00.00
PT08.S4(NO2)        1587.0
Name: 100, dtype: object

C6H6(GT)          9,0
PT08.S1(CO)    1324.0
Name: 100, dtype: object

## Slice the Regression Dataset

In [9]:
regression_data[20:30]

RegressionDataset with 11 instances

In [10]:
regression_data[20:30].unify()

          Date      Time  PT08.S4(NO2) C6H6(GT)  PT08.S1(CO)
20  11/03/2004  14.00.00        1730.0      NaN          NaN
21  11/03/2004  15.00.00        1647.0      NaN          NaN
22  11/03/2004  16.00.00        1591.0      NaN          NaN
23  11/03/2004  17.00.00        1719.0      NaN          NaN
24  11/03/2004  18.00.00        2083.0      NaN          NaN
25  11/03/2004  19.00.00        2333.0      NaN          NaN
26  11/03/2004  20.00.00        2191.0      NaN          NaN
27  11/03/2004  21.00.00        1707.0      NaN          NaN
28  11/03/2004  22.00.00        1333.0      NaN          NaN
29  11/03/2004  23.00.00        1252.0      NaN          NaN
30  12/03/2004  00.00.00        1375.0      NaN          NaN
20         NaN       NaN           NaN     11,5       1371.0
21         NaN       NaN           NaN      8,8       1310.0
22         NaN       NaN           NaN      8,3       1292.0
23         NaN       NaN           NaN     11,2       1383.0
24         NaN       NaN           NaN     20,8       1581.0
25         NaN       NaN           NaN     27,4       1776.0
26         NaN       NaN           NaN     24,0       1640.0
27         NaN       NaN           NaN     12,8       1313.0
28         NaN       NaN           NaN      4,7        965.0
29         NaN       NaN           NaN      2,6        913.0
30         NaN       NaN           NaN      5,9       1080.0

## Split Dataset to train/test

In [12]:
train_data, test_data = regression_data.train_test_split(test_size=0.2)
print(train_data)
print(test_data)

RegressionDataset with 7577 instances
RegressionDataset with 1895 instances

## Print length of train/test splits

In [13]:
print(len(train_data), len(test_data))

7577 1895